base/Documents/бит_му_ОбесценениеОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_му_ОбесценениеОС</Name>
			<Comment>(БИТ МУ)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.бит_Дополнительный_4</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоБюджетам</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_3</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_1</xr:Item>
				<xr:Item>InformationRegister.бит_му_ПараметрыОС</xr:Item>
				<xr:Item>AccumulationRegister.бит_СоответствиеОборотовТрансляции</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоТипамПроводок</xr:Item>
				<xr:Item>AccountingRegister.бит_Бюджетирование</xr:Item>
				<xr:Item>InformationRegister.бит_му_СобытияОС</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_5</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_2</xr:Item>
				<xr:Item>InformationRegister.бит_СоответствиеЗаписейТрансляции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_ВидыОперацийОбесценениеОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Comment>Вид движения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_ВидыДвиженияОбесценения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_ПодразделениеМСФО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>МОЛ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьВЗакрытомПериоде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеСредства</Name>
					<Comment>Основные средства</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Comment>Основное средство</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БалансоваяСтоимость</Name>
							<Comment>Балансовая стоимость</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозмещаемаяСтоимость</Name>
							<Comment>Возмещаемая стоимость</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Возмещаемая стоимость</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОбесценения</Name>
							<Comment>Причина обесценения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_му_ПричиныОбесцененияВНА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетСниженияСтоимости</Name>
							<Comment>Счет снижения стоимости</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДоходовРасходов</Name>
							<Comment>Счет доходов/расходов от обесценения ОС</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>Субконто1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>Субконто1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>Субконто1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто4</Name>
							<Comment>Субконто1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоНаправлениямДеятельности</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКорректироватьСтоимостьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

base/Enums/бит_му_ВидыДвиженияОбесценения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_му_ВидыДвиженияОбесценения</Name>
			<Comment>(БИТ МУ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФормированиеРезерва</Name>
					<Comment>Формирование резерва</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОбесценения</Name>
					<Comment>Возврат обесценения</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_му_ВидыКлассовОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_му_ВидыКлассовОС</Name>
			<Comment>(БИТ МУ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновныеСредства</Name>
					<Comment>Основные средства</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнвестиционнаяСобственность</Name>
					<Comment>Инвестиционная собственность</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_му_ВидыОперацийОбесценениеОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_му_ВидыОперацийОбесценениеОС</Name>
			<Comment>(БИТ МУ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновныеСредства</Name>
					<Comment>Основные средства</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнвестиционнаяСобственность</Name>
					<Comment>Инвестиционная собственность</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Documents/бит_му_ОбесценениеОС/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте 
Перем мКэшРеквизитовФормы; // Хранит текущие значения реквизитов формы. Клиент.

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
		
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
					
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	бит_БухгалтерскийУчет.УстановитьНачальныеСвойстваСубконтоТаблицы(
		Объект.ОсновныеСредства,
		ПараметрыУстановкиСвойствСубконтоСчетДоходовРасходов(ЭтотОбъект));
		
	УстановитьУсловноеОформление();
	
	УправлениеФормой(ЭтотОбъект);
	
	ЗаполнитьИнвентарныеНомера();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
		
	// Фиксация 1 субконто для сохранения внешнего вида формы
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	// АПК:277-выкл Проектное решение вызвать функционал другой подсистемы.
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ОсновныеСредстваСубконто1");
	// АПК:277-вкл

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ОсновныеСредства.Субконто1Доступность", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
		
	// Субконто
	Для Сч = 2 По 4 Цикл

		// СубконтоДт
		ЭлементУО = УсловноеОформление.Элементы.Добавить();

		// АПК:277-выкл Проектное решение вызвать функционал другой подсистемы.
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ОсновныеСредстваСубконто" + Сч);
        // АПК:277-вкл

		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.ОсновныеСредства.Субконто" + Сч + "Доступность", ВидСравненияКомпоновкиДанных.Равно, Ложь);

		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		
	КонецЦикла;
															   															  												   						
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды  
	
	ЗаполнитьТекущиеЗначенияРеквизитовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		Если ВыбранноеЗначение.Свойство("Действие") Тогда
			
			Если ВРег(ВыбранноеЗначение.Действие) = ВРег("Загрузить") Тогда
				
				Если Объект.ОсновныеСредства.Количество() > 0 Тогда
					
					Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораЗавершение", ЭтотОбъект, ВыбранноеЗначение);
					ТекстВопроса = НСтр("ru='Табличная часть ""Основные средства"" будет очищена. Продолжить?';
										|en='Tabular part of ""Fixed assets"" will be cleared. Continue?'");
					ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет);
					
				Иначе
					
					ОбработатьПодборОС(ВыбранноеЗначение);
					
				КонецЕсли;
				
			Иначе
				
				ОбработатьПодборОС(ВыбранноеЗначение);
				
			КонецЕсли; 
			
		КонецЕсли; // В структуре есть поле действие 
		
	КонецЕсли; // Это структура
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ОсновныеСредства.Очистить();
	Иначе
		Возврат;
	КонецЕсли;
	
	ОбработатьПодборОС(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	Если ПараметрыЗаписи.РежимЗаписи = ПредопределенноеЗначение("РежимЗаписиДокумента.Проведение") Тогда
		КлючеваяОперация = "Проведениебит_му_ОбесценениеОС";
		ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьИнвентарныеНомера();
	УстановитьСостояниеДокумента();
	
	бит_БухгалтерскийУчет.УстановитьНачальныеСвойстваСубконтоТаблицы(
		Объект.ОсновныеСредства,
		ПараметрыУстановкиСвойствСубконтоСчетДоходовРасходов(ЭтотОбъект));
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	УстановитьКурсКратностьДокумента(Объект.ВалютаДокумента, Объект.Дата, Объект.КурсДокумента, Объект.КратностьДокумента);
		
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если Объект.Организация <> ТекущаяОрганизация 
		И Объект.ОсновныеСредства.Количество() > 0 Тогда
		
		Оповещение = Новый ОписаниеОповещения("ОбработатьИзменениеОрганизации", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Табличная часть будет очищена. Продолжить?';en='Tabular section will be cleaned. Continue?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 5, КодВозвратаДиалога.Нет);
		
	Иначе
		
		ПриИзмененииОрганизации();
	
		ТекущаяОрганизация = Объект.Организация;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - завершение изменения реквизита "Организация".
// 
&НаКлиенте
Процедура ОбработатьИзменениеОрганизации(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Объект.Организация = ТекущаяОрганизация;
		Возврат;
	КонецЕсли;
	
	Объект.ОсновныеСредства.Очистить();
	
	ПриИзмененииОрганизации();
	
	ТекущаяОрганизация = Объект.Организация;
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)
	
	ИзменениеВалютыКлиент();
	
КонецПроцедуры

// Процедура обрабатывает изменение валюты документа. Клиент.
// 
// Параметры:
//  Нет.
// 
&НаКлиенте
Процедура ИзменениеВалютыКлиент() 
	
	ИзменениеВалютыСервер();
	
	ТаблицаОбъекта = Объект.ОсновныеСредства;
	
	// Спросим, а не пересчитать ли суммы.
	Если Не мКэшРеквизитовФормы.ВалютаДокумента = Объект.ВалютаДокумента 
		И ТаблицаОбъекта.Количество()>0 
		И ЗначениеЗаполнено(мКэшРеквизитовФормы.ВалютаДокумента)
		И ЗначениеЗаполнено(Объект.ВалютаДокумента)Тогда
		
		Оповещение = Новый ОписаниеОповещения("ИзменениеВалютыЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Изменилась валюта документа. Пересчитать суммы документа?';
							|en='Document currency has changed. Recalculate document total?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет);	
		
	Иначе
		
		ДобавитьВКэш("ВалютаДокумента");
		ДобавитьВКэш("КратностьДокумента");
		ДобавитьВКэш("КурсДокумента");
		
	КонецЕсли;
		
КонецПроцедуры // ИзменениеВалютыКлиент()

// Процедура-обработчик оповещения вопроса из процедуры ИзменениеВалютыКлиент.
// 
&НаКлиенте
Процедура ИзменениеВалютыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ТаблицаОбъекта = Объект.ОсновныеСредства;
		
		// Получим курсы валют на дату принятия к учету для каждого ОС.
		КурсыСтарые = ПолучитьКурсыВалютПоПериодам(мКэшРеквизитовФормы);
		КурсыНовые = ПолучитьКурсыВалютПоПериодам(,Истина);
		
		МассивСуммДляПересчета = Новый Массив;
		МассивСуммДляПересчета.Добавить("ВозмещаемаяСтоимость");
		МассивСуммДляПересчета.Добавить("БалансоваяСтоимость");
		
		
		Для Каждого СтрокаТаблицы Из ТаблицаОбъекта Цикл
				
				Для каждого ИмяСуммы Из МассивСуммДляПересчета Цикл
					
					// Балансовую стоимость рассчитаем на дату принятия к учету ОС.
					Если ИмяСуммы = "БалансоваяСтоимость" Тогда
						
						Если НЕ КурсыСтарые[СтрокаТаблицы.ОсновноеСредство] = Неопределено 
							И НЕ КурсыНовые[СтрокаТаблицы.ОсновноеСредство] = Неопределено Тогда
							
							СтарыеКурсы = КурсыСтарые[СтрокаТаблицы.ОсновноеСредство].СтарыеКурсы;
							НовыеКурсы = КурсыНовые[СтрокаТаблицы.ОсновноеСредство].НовыеКурсы;

						
							СтрокаТаблицы[ИмяСуммы] = бит_КурсыВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы[ИмяСуммы]
																									,СтарыеКурсы.Валюта
																									,НовыеКурсы.Валюта
																									,СтарыеКурсы.Курс
																									,НовыеКурсы.Курс
																									,СтарыеКурсы.Кратность
																									,НовыеКурсы.Кратность);
	                    
						КонецЕсли;
																								
					// Возмещаемую стоимость рассчитаем на дату документа.
					Иначе
					
	                    СтрокаТаблицы[ИмяСуммы] = бит_КурсыВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы[ИмяСуммы]
																							   ,мКэшРеквизитовФормы.ВалютаДокумента
																							   ,Объект.ВалютаДокумента
																							   ,мКэшРеквизитовФормы.КурсДокумента
																							   ,Объект.КурсДокумента
																							   ,мКэшРеквизитовФормы.КратностьДокумента
																							   ,Объект.КратностьДокумента);
					КонецЕсли; 
					
					
					
				КонецЦикла;
			
			// Рассчитаем сумму
			РассчитатьСуммуВСтрокеТЧ(СтрокаТаблицы.ПолучитьИдентификатор());
		КонецЦикла;
	КонецЕсли; 
	
	ДобавитьВКэш("ВалютаДокумента");
	ДобавитьВКэш("КратностьДокумента");
	ДобавитьВКэш("КурсДокумента");

КонецПроцедуры // ИзменениеВалютыЗавершение()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОсновныеСредства

&НаКлиенте
Процедура ОсновныеСредстваОсновноеСредствоПриИзменении(Элемент)
														  
	ТекущаяСтрока = Элементы.ОсновныеСредства.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПриИзмененииОС(ТекущаяСтрока.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваВозмещаемаяСтоимостьПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ОсновныеСредства.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьСуммуВСтрокеТЧ(ТекущаяСтрока.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСчетДоходовРасходовПриИзменении(Элемент)
	
	бит_БухгалтерияКлиентСервер.УстановитьСвойстваСубконтоСтрокиПриИзмененииСчета(
		ЭтотОбъект,
		Элементы.ОсновныеСредства.ТекущиеДанные,
		ПараметрыУстановкиСвойствСубконтоСчетДоходовРасходов(ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСчетДоходовРасходовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка) 
	
	ДанныеОбъекта = бит_БухгалтерияКлиентСервер.ДанныеУстановкиПараметровСубконто(
		Элементы.ОсновныеСредства.ТекущиеДанные,
		ПараметрыУстановкиСвойствСубконтоСчетДоходовРасходов(ЭтотОбъект));
	
	ОбщегоНазначенияБПКлиент.НачалоВыбораЗначенияСубконто(ЭтотОбъект, Элемент, СтандартнаяОбработка, ДанныеОбъекта);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСубконто1ПриИзменении(Элемент)
	ПриИзмененииСубконтоСчетДоходовРасходов(1);
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСубконто2ПриИзменении(Элемент)
	ПриИзмененииСубконтоСчетДоходовРасходов(2);
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСубконто3ПриИзменении(Элемент)
	ПриИзмененииСубконтоСчетДоходовРасходов(3);
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСубконто4ПриИзменении(Элемент)
	ПриИзмененииСубконтоСчетДоходовРасходов(4);
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДанныеОбъекта = бит_БухгалтерияКлиентСервер.ДанныеУстановкиПараметровСубконто(
		Элементы.ОсновныеСредства.ТекущиеДанные,
		ПараметрыУстановкиСвойствСубконтоСчетДоходовРасходов(ЭтотОбъект));
	
	ОбщегоНазначенияБПКлиент.НачалоВыбораЗначенияСубконто(ЭтотОбъект, Элемент, СтандартнаяОбработка, ДанныеОбъекта);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Процедура ПодборОС(Команда)
	
	ПараметрыФормы = ЗаполнитьПараметрыПодбора();
	
	ОткрытьФорму("Обработка.бит_му_ПодборВНА.Форма",ПараметрыФормы,ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсе(Команда)
	
	Если Объект.ОсновныеСредства.Количество() > 0 Тогда
		
		Оповещение = Новый ОписаниеОповещения("КомандаЗаполнитьВсеЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Параметры в табличной части будут перезаполнены. Продолжить?';
							|en='The parameters in the tabular part will be refilled. Continue?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 5, КодВозвратаДиалога.Нет);
		
	Иначе
		
		ЗаполнитьОС();
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - завершение обработки команды "ЗаполнитьВсе".
// 
&НаКлиенте
Процедура КомандаЗаполнитьВсеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОС();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоТекущейСтроке(Команда)
	
	ТекущаяСтрока = Элементы.ОсновныеСредства.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПриИзмененииОС(ТекущаяСтрока.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьПоГруппеОС(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("БалансоваяСтоимость", Объект.ОсновныеСредства.Итог("БалансоваяСтоимость"));
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗакрытиеОбесценениеГруппыОС", ЭтотОбъект);
	ОткрытьФорму("Документ.бит_му_ОбесценениеОС.Форма.ОбесценениеГруппыОС", ПараметрыФормы, 
		ЭтотОбъект,,,,ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеОбесценениеГруппыОС(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	БалансоваяСтоимость = Объект.ОсновныеСредства.Итог("БалансоваяСтоимость");
	СуммаВозмещения     = Результат.ВозмещаемаяСтоимость;
	
	Макс     = 0;
	ИдСтроки = 0;
	СуммаВозмещенияОстаток = СуммаВозмещения;
	Для каждого СтрокаТаблицы Из Объект.ОсновныеСредства Цикл
		Если СтрокаТаблицы.БалансоваяСтоимость > Макс Тогда
			Макс     = СтрокаТаблицы.БалансоваяСтоимость;
			ИдСтроки = СтрокаТаблицы.ПолучитьИдентификатор();
		КонецЕсли; 
		СтрокаТаблицы.ВозмещаемаяСтоимость = СуммаВозмещения * (СтрокаТаблицы.БалансоваяСтоимость/БалансоваяСтоимость);
		СтрокаТаблицы.Сумма = СтрокаТаблицы.БалансоваяСтоимость - СтрокаТаблицы.ВозмещаемаяСтоимость;
		СуммаВозмещенияОстаток = СуммаВозмещенияОстаток - СтрокаТаблицы.ВозмещаемаяСтоимость;
	КонецЦикла; 
	
	Если СуммаВозмещенияОстаток > 0 Тогда
		СтрокаТаблицы = Объект.ОсновныеСредства.НайтиПоИдентификатору(ИдСтроки);
	    СтрокаТаблицы.ВозмещаемаяСтоимость = СтрокаТаблицы.ВозмещаемаяСтоимость + СуммаВозмещенияОстаток;
		СтрокаТаблицы.Сумма = СтрокаТаблицы.БалансоваяСтоимость - СтрокаТаблицы.ВозмещаемаяСтоимость;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ЗаполнитьВалютуМСФО();
	УстановитьСостояниеДокумента();     
	
	РазрешеноОтражениеДокументовВЗакрытомПериоде = бит_ПраваДоступа.ПолучитьЗначениеДопПраваПользователя(
		Пользователи.ТекущийПользователь(),
	 	ПланыВидовХарактеристик.бит_ДополнительныеПраваПользователей.РазрешеноОтражениеДокументовВЗакрытомПериоде);
		
    ТекущаяОрганизация = Объект.Организация;
	КоличествоСубконтоМУ = 4;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = бит_ОбщегоНазначения.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
																   
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Элементы.ОтразитьВЗакрытомПериоде.Видимость = Форма.РазрешеноОтражениеДокументовВЗакрытомПериоде;
	// ++ ЕРП
	Элементы.ДанныеБУ.Видимость = Истина;   
	// -- ЕРП
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВалютуМСФО(ИзменениеОрганизации = Истина)
	
	// Получим валюту международного учета.
	ВалютаМСФО = бит_му_ОбщегоНазначения.ПолучитьВалютуМеждународногоУчета(Объект.Организация);
	СтрокаВалютаМежУчета = Строка(ВалютаМСФО);
	
	Элементы.ДекорацияВалютаМСФО.Заголовок = ?(ПустаяСтрока(СтрокаВалютаМежУчета), "НЕ УСТАНОВЛЕНА", СтрокаВалютаМежУчета);
	
	Если ИзменениеОрганизации Тогда
		Объект.ВалютаДокумента = ВалютаМСФО;
		УстановитьКурсКратностьДокумента(Объект.ВалютаДокумента, Объект.Дата, Объект.КурсДокумента, Объект.КратностьДокумента);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьКурсКратностьДокумента(Валюта, Дата, Курс, Кратность)
    
    СтрКурса = бит_КурсыВалют.ПолучитьКурсВалюты(Валюта, Дата);
    
    Курс      = СтрКурса.Курс;
    Кратность = СтрКурса.Кратность;
    
КонецПроцедуры // ИзменениеВалюты()

&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыУстановкиСвойствСубконтоСчетДоходовРасходов(Форма)
	
	Результат = бит_БухгалтерияКлиентСервер.НовыеПараметрыУстановкиСвойствСубконто();
	                       
	Результат.ПоляФормы.Субконто1   = "ОсновныеСредстваСубконто1";
	Результат.ПоляОбъекта.Субконто1 = "Субконто1";
	Результат.ПоляФормы.Субконто2   = "ОсновныеСредстваСубконто2";
	Результат.ПоляОбъекта.Субконто2 = "Субконто2";
	Результат.ПоляФормы.Субконто3   = "ОсновныеСредстваСубконто3";
	Результат.ПоляОбъекта.Субконто3 = "Субконто3";
	Результат.ПоляФормы.Субконто4   = "ОсновныеСредстваСубконто4";
	Результат.ПоляОбъекта.Субконто4 = "Субконто4";
	Результат.ПоляОбъекта.СчетУчета = "СчетДоходовРасходов";
	
	Результат.ДопРеквизиты.Вставить("Организация", Форма.Объект.Организация);

	Возврат Результат;

КонецФункции

&НаСервере
Процедура ЗаполнитьИнвентарныеНомера(ИДСтроки = Неопределено)
	
	СоответствиеОС_ИнвентарныйНомер = Новый Соответствие;
	
	Если ИДСтроки = Неопределено Тогда
		
		бит_му_ВНА.ЗаполнитьСоответствиеОС_ИнвентарныйНомер(СоответствиеОС_ИнвентарныйНомер,
			Объект.ОсновныеСредства.Выгрузить().ВыгрузитьКолонку("ОсновноеСредство"), Объект.Организация);
													   
		Для Каждого ТекСтрока Из Объект.ОсновныеСредства Цикл
			ТекСтрока.ИнвентарныйНомер = СоответствиеОС_ИнвентарныйНомер[ТекСтрока.ОсновноеСредство];
		КонецЦикла;
		
	Иначе
		
		ДанныеСтроки = Объект.ОсновныеСредства.НайтиПоИдентификатору(ИДСтроки);		
		Если ДанныеСтроки <> Неопределено Тогда
			ДанныеСтроки.ИнвентарныйНомер = бит_му_ВНА.ИнвентарныйНомерОсновногоСредства(СоответствиеОС_ИнвентарныйНомер,
												ДанныеСтроки.ОсновноеСредство, Объект.Организация);
		КонецЕсли;
																				
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПодборОС(ВыбранноеЗначение)
	
	ЗаполнитьТчОсновныеСредстваПоДаннымПодбора(ВыбранноеЗначение);
	
	ЗаполнитьИнвентарныеНомера();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТчОсновныеСредстваПоДаннымПодбора(ВыбранноеЗначение, ЭтоНовыйДокумент = Истина)
	
	ОписаниеТаблицы = ВыбранноеЗначение.Данные;
	ТаблицаДанных = бит_ОбщегоНазначения.РаспаковатьТаблицуИзМассива(ОписаниеТаблицы.ПереченьОбъектов, ОписаниеТаблицы.ПереченьОбъектов_Колонки);
	
	МассивОС = ТаблицаДанных.ВыгрузитьКолонку("ВНА");
	бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивОС); 
	ПараметрыОбъектов = ПолучитьПараметры(МассивОС);
	Если ДанныеБУ Тогда   
	    ДополнитьПараметрыОбъектовДаннымиБУ(ПараметрыОбъектов, МассивОС);	
	КонецЕсли;
	
	ВыполнитьВалютныеПересчетыИзВалютыМУВВалютуДокумента(ПараметрыОбъектов); 
		
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ОсновноеСредство", СтрокаТаблицы.ВНА);
		
		МассивСтрок = Объект.ОсновныеСредства.НайтиСтроки(СтруктураОтбора);
		
		Если МассивСтрок.Количество() = 0 Тогда
			НайденнаяСтрока = Неопределено;
		Иначе
			НайденнаяСтрока = МассивСтрок[0];
		КонецЕсли;
		
		Если НайденнаяСтрока = Неопределено Тогда
			
			НоваяСтрока = Объект.ОсновныеСредства.Добавить();
			НоваяСтрока.ОсновноеСредство = СтрокаТаблицы.ВНА;
			СтрокаПараметров = ПараметрыОбъектов[НоваяСтрока.ОсновноеСредство];
			ЗаполнитьСтрокуТЧПоСтрокеДанных(НоваяСтрока, СтрокаПараметров);
			
		Иначе
			
			ТекстСообщения = НСтр("ru = 'Основное средство ""%1"" инв. №%2 уже подобрано в строке №%3.'; 
			                      |en = 'Fixed asset ""%1"" inv. №%2 is already matched in line №%3.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения,
			                           СтрокаТаблицы.ВНА,
									   СтрокаТаблицы.ИнвентарныйНомер,
									   НайденнаяСтрока.НомерСтроки);
									   
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли;
				
	КонецЦикла; // По строкам таблицы данных			

КонецПроцедуры // ЗаполнитьТчОсновныеСредстваПоДаннымПодбора()

&НаСервере
Процедура ДополнитьПараметрыОбъектовДаннымиБУ(ПараметрыОбъектов, МассивОС)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Счет",        ПланыСчетов.Хозрасчетный.ОбесценениеОС_01);
	Запрос.УстановитьПараметр("МассивОС",    МассивОС);
	Запрос.УстановитьПараметр("КонецПериода",Объект.Дата);
	
	Субконто = Новый Массив;
	Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
	Запрос.УстановитьПараметр("Субконто", Субконто);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХозрасчетныйОбороты.Счет КАК Счет,
	               |	ХозрасчетныйОбороты.СуммаОборотДт КАК СуммаОборотДт,
	               |	ХозрасчетныйОбороты.СуммаОборотКт КАК СуммаОборотКт,
	               |	ХозрасчетныйОбороты.Субконто1 КАК ОсновноеСредство
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Обороты(
	               |			,
	               |			&КонецПериода,
	               |			,
	               |			Счет = &Счет,
	               |			&Субконто,
	               |			Организация = &Организация
	               |				И Субконто1 В (&МассивОС),
	               |			,
	               |			) КАК ХозрасчетныйОбороты";
				   
    Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ДанныеКурсаДокумент = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаДокумента, Объект.Дата);
	ДанныеКурсаБУ       = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Константы.ВалютаРегламентированногоУчета.Получить(), Объект.Дата);
	
	ОбесценениеБУ = Новый Соответствие; 
	Пока Выборка.Следующий() Цикл     
		СуммаОбесценения = ?(Объект.ВидДвижения = Перечисления.бит_му_ВидыДвиженияОбесценения.ВозвратОбесценения, Выборка.СуммаОборотДт, Выборка.СуммаОборотКт);
		ПараметрыОбъектов[Выборка.ОсновноеСредство].СуммаОбесценения = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СуммаОбесценения, ДанныеКурсаБУ, ДанныеКурсаДокумент);
	КонецЦикла;
			
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииОрганизации()
	
	ПараметрыПроверки = бит_ОбщегоНазначения.НовыеПараметрыПроверитьПринадлежностьАналитики();
	ПараметрыПроверки.Контейнер 			   = Объект;
	ПараметрыПроверки.ИмяРеквизита			   = "Подразделение";
	ПараметрыПроверки.ИмяПроверочногоРеквизита = "Владелец";
	ПараметрыПроверки.ИмяКонтрольногоЗначения  = "Организация";
	ПараметрыПроверки.ИмяТипа 				   = "СправочникСсылка.ПодразделенияОрганизаций";
	ПараметрыПроверки.НачалоСообщения 		   = НСтр("ru = 'В документе'; en = 'In the document'");
	ПараметрыПроверки.Заголовок 			   = НСтр("ru = 'Изменение значения реквизита Организация'; en = 'Changing the value of the requisite Organization'");

	бит_ОбщегоНазначения.ПроверитьПринадлежностьАналитики(ПараметрыПроверки);
														  
	// Установим валюту межд. учета
	ЗаполнитьВалютуМСФО(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииОС(Знач ИДСтроки)
	
	ТекущаяСтрока = Объект.ОсновныеСредства.НайтиПоИдентификатору(ИДСтроки);	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОбъектов = ПолучитьПараметры(ТекущаяСтрока.ОсновноеСредство);
	
	Если ДанныеБУ Тогда 
		МассивОС = Новый Массив;
		МассивОС.Добавить(ТекущаяСтрока.ОсновноеСредство);
	    ДополнитьПараметрыОбъектовДаннымиБУ(ПараметрыОбъектов, МассивОС);	
	КонецЕсли;
	
	ВыполнитьВалютныеПересчетыИзВалютыМУВВалютуДокумента(ПараметрыОбъектов); 
	
	СтрокаДанных = ПараметрыОбъектов[ТекущаяСтрока.ОсновноеСредство];
	
	ВидыОперацийПоКлассу = Новый Соответствие;
	ВидыОперацийПоКлассу.Вставить(Перечисления.бит_му_ВидыКлассовОС.ОсновныеСредства,
		Перечисления.бит_му_ВидыОперацийОбесценениеОС.ОсновныеСредства);
	ВидыОперацийПоКлассу.Вставить(Перечисления.бит_му_ВидыКлассовОС.ИнвестиционнаяСобственность,
		Перечисления.бит_му_ВидыОперацийОбесценениеОС.ИнвестиционнаяСобственность);
									
	Если СтрокаДанных <> Неопределено Тогда
	
		Если ВидыОперацийПоКлассу[СтрокаДанных.ВидКласса] <> Объект.ВидОперации Тогда
			
			ТекстСообщения = НСтр("ru = 'В строке №%1 табличной части ""Основные средства"" вид класса ""%2"" основного средства ""%3"" не соответствует виду операции документа.'; 
			                      |en = 'In line №%1 of the fixed assets tabular part, class type ""%2"" of fixed asset ""%3"" does not correspond to the document transaction type.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ТекущаяСтрока.НомерСтроки, СтрокаДанных.ВидКласса, ТекущаяСтрока.ОсновноеСредство);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
			ТекущаяСтрока.ОсновноеСредство = Неопределено;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	ЗаполнитьСтрокуТЧПоСтрокеДанных(ТекущаяСтрока, СтрокаДанных);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметры(ПереченьОбъектов)
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Организация", Объект.Организация);
	Реквизиты.Вставить("Дата",        Объект.Дата);
	Реквизиты.Вставить("ВидДвижения", Объект.ВидДвижения);
	Реквизиты.Вставить("ЭтоНовыйДокумент", Параметры.Ключ.Пустая());
		
	Возврат Документы.бит_му_ОбесценениеОС.ПолучитьПараметры(Реквизиты, ПереченьОбъектов);

КонецФункции // ПолучитьПараметрыОС()

&НаСервере
Процедура РассчитатьСуммуВСтрокеТЧ(Идентификатор)

	ТекущаяСтрока = Объект.ОсновныеСредства.НайтиПоИдентификатору(Идентификатор);
	
	ТекущаяСтрока.Сумма = ТекущаяСтрока.БалансоваяСтоимость - ТекущаяСтрока.ВозмещаемаяСтоимость;

	Если Объект.ВидДвижения = Перечисления.бит_му_ВидыДвиженияОбесценения.ВозвратОбесценения Тогда		
		ТекущаяСтрока.Сумма = -ТекущаяСтрока.Сумма; 		
	КонецЕсли;
	
КонецПроцедуры // РассчитатьСуммуВСтрокеТЧ()

&НаСервере
Процедура ЗаполнитьСтрокуТЧПоСтрокеДанных(СтрокаТабличнойЧасти, СтрокаДанных)
		
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаДанных);   
	
	Если ДанныеБУ Тогда
		
		СтрокаТабличнойЧасти.Сумма = СтрокаДанных.СуммаОбесценения;
		Если Объект.ВидДвижения = Перечисления.бит_му_ВидыДвиженияОбесценения.ВозвратОбесценения Тогда		
			СтрокаТабличнойЧасти.ВозмещаемаяСтоимость = СтрокаТабличнойЧасти.БалансоваяСтоимость + СтрокаТабличнойЧасти.Сумма;
		Иначе
		    СтрокаТабличнойЧасти.ВозмещаемаяСтоимость = СтрокаТабличнойЧасти.БалансоваяСтоимость - СтрокаТабличнойЧасти.Сумма;	
		КонецЕсли;  
		
	Иначе
		
		СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.БалансоваяСтоимость - СтрокаТабличнойЧасти.ВозмещаемаяСтоимость;

		Если Объект.ВидДвижения = Перечисления.бит_му_ВидыДвиженияОбесценения.ВозвратОбесценения Тогда		
			СтрокаТабличнойЧасти.Сумма = -СтрокаТабличнойЧасти.Сумма; 		
		КонецЕсли;
	
	КонецЕсли;
	
	
	ЗаполнитьИнвентарныеНомера();
	
КонецПроцедуры // ЗаполнитьСтрокуТЧПоСтрокеДанных()

&НаСервере
Процедура ЗаполнитьОС()
	
	МассивОС = Объект.ОсновныеСредства.Выгрузить().ВыгрузитьКолонку("ОсновноеСредство");
	бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивОС);
	ПараметрыОбъектов = ПолучитьПараметры(МассивОС);	
	
	Если ДанныеБУ Тогда 
	    ДополнитьПараметрыОбъектовДаннымиБУ(ПараметрыОбъектов, МассивОС);	
	КонецЕсли;
	
	ВыполнитьВалютныеПересчетыИзВалютыМУВВалютуДокумента(ПараметрыОбъектов); 
	
	ЗаполнитьИнвентарныеНомера();
	
	Для Каждого ТекущаяСтрока Из Объект.ОсновныеСредства Цикл
		
		СтрокаДанных = ПараметрыОбъектов[ТекущаяСтрока.ОсновноеСредство];
		ЗаполнитьСтрокуТЧПоСтрокеДанных(ТекущаяСтрока,СтрокаДанных);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКурсыВалютПоПериодам(КешСтарыеКурсы = Неопределено, флНовыеКурсы = Ложь)
	
	Если флНовыеКурсы Тогда
		
		НовыеКурсы = Новый Структура;
		НовыеКурсы.Вставить("Валюта", Объект.ВалютаДокумента);
		НовыеКурсы.Вставить("Кратность", Объект.КратностьДокумента);
		НовыеКурсы.Вставить("Курс", Объект.КурсДокумента);
		
		СтруктураКурсовВалют = Новый Структура;
		СтруктураКурсовВалют.Вставить("НовыеКурсы", НовыеКурсы);
		
	Иначе
		
		СтарыеКурсы = Новый Структура;
		СтарыеКурсы.Вставить("Валюта", КешСтарыеКурсы.ВалютаДокумента); 
		СтарыеКурсы.Вставить("Кратность", КешСтарыеКурсы.КратностьДокумента);
		СтарыеКурсы.Вставить("Курс", КешСтарыеКурсы.КурсДокумента);
		
		СтруктураКурсовВалют = Новый Структура;
		СтруктураКурсовВалют.Вставить("СтарыеКурсы", СтарыеКурсы);
		
	КонецЕсли; 
	
	МассивОС = Объект.ОсновныеСредства.Выгрузить().ВыгрузитьКолонку("ОсновноеСредство");
	ТаблицаДанных = Документы.бит_му_ОбесценениеОС.ПодготовитьТаблицуДатПринятияОС(Объект.Организация, МассивОС);
	ТаблицаПериодов = ТаблицаДанных.Скопировать(, "Период");
	Курсы = бит_КурсыВалют.ПолучитьКурсыВалютПоПериодам(ТаблицаПериодов, Неопределено, СтруктураКурсовВалют);
	
	СоответствиеКурсовИОС = Новый Соответствие;
	
	Для каждого Строка Из ТаблицаДанных Цикл
		СоответствиеКурсовИОС.Вставить(Строка.ОсновноеСредство, Курсы[Строка.Период])
	КонецЦикла; 

	Возврат СоответствиеКурсовИОС;
	
КонецФункции

// Процедура обрабатывает изменение валюты документа.
// 
// Параметры:
//  Нет.
// 
&НаСервере
Процедура ИзменениеВалютыСервер()
	                 
	КурсыВалют = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаДокумента, Объект.Дата);
	Объект.КурсДокумента      = КурсыВалют.Курс;
	Объект.КратностьДокумента = КурсыВалют.Кратность;
	
	ЗаполнитьИнвентарныеНомера();
	  
КонецПроцедуры // ИзменениеВалютыСервер()

// Функция получает параметры, передаваемые в обработку подбора ОС.
//
&НаСервере
Функция ЗаполнитьПараметрыПодбора()

	Если Объект.ВидОперации = Перечисления.бит_му_ВидыОперацийОбесценениеОС.ОсновныеСредства Тогда
		ВидКласса = Перечисления.бит_му_ВидыКлассовОС.ОсновныеСредства;
	Иначе
		ВидКласса = Перечисления.бит_му_ВидыКлассовОС.ИнвестиционнаяСобственность;
	КонецЕсли;
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыПодбора.Вставить("Организация"		  , Объект.Организация);                             
	ПараметрыПодбора.Вставить("Режим"			  , Перечисления.бит_му_РежимыПодбораВНА.ОбесценениеОС);
	ПараметрыПодбора.Вставить("ДатаОкончания"	  , КонецМесяца(Объект.Дата));
	ПараметрыПодбора.Вставить("МОЛ"				  , Объект.МОЛ);
	ПараметрыПодбора.Вставить("Местонахождение"	  , Объект.Подразделение);
	ПараметрыПодбора.Вставить("ВидКласса"		  , ВидКласса);
	ПараметрыПодбора.Вставить("МодельУчета"		  , Перечисления.бит_му_МоделиУчетаВНА.ПоПервоначальнойСтоимости);	
	
	Возврат ПараметрыПодбора;
	
КонецФункции // ЗаполнитьПараметрыПодбора()

#Область РаботаСКэшемРеквизитовФормы

&НаКлиенте 
Процедура ЗаполнитьТекущиеЗначенияРеквизитовФормы()
	
	// Зададим имена реквизитов, подлежащих кешированию.
	мКэшРеквизитовФормы = Новый Структура;
	мКэшРеквизитовФормы.Вставить("ВалютаДокумента");
	мКэшРеквизитовФормы.Вставить("КурсДокумента");
	мКэшРеквизитовФормы.Вставить("КратностьДокумента");
	
	Для Каждого КлючИЗначение Из мКэшРеквизитовФормы Цикл
		мКэшРеквизитовФормы[КлючИЗначение.Ключ] = Объект[КлючИЗначение.Ключ];
	КонецЦикла; 
	
КонецПроцедуры // ЗаполнитьТекущиеЗначенияРеквизитовФормы()

&НаКлиенте
Процедура ДобавитьВКэш(ИмяРеквизита)
	
	мКэшРеквизитовФормы[ИмяРеквизита] = Объект[ИмяРеквизита];	
	
КонецПроцедуры // ДобавитьВКэш()

#КонецОбласти

  &НаКлиенте
Функция ПолучитьЗначениеСубконтоТабПоле(ТекущаяСтрока,ИмяТабличногоПоля,ИмяЭлемента)

	ЗначениеСубконто = Неопределено;
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		
		ИмяРеквизита      = СтрЗаменить(ИмяЭлемента,ИмяТабличногоПоля,"");
		ЗначениеСубконто  = ТекущаяСтрока[ИмяРеквизита];
		
	КонецЕсли; 

	Возврат ЗначениеСубконто;
	
КонецФункции // ПолучитьЗначениеСубконтоТабПоле()

&НаКлиенте
Процедура ПриИзмененииСубконтоСчетДоходовРасходов(НомерСубконто)
	
	бит_БухгалтерияКлиент.УстановитьСвойстваСубконтоСтрокиПриИзмененииСубконто(
		ЭтотОбъект, 
		Элементы.ОсновныеСредства.ТекущиеДанные,
		НомерСубконто, 
		ПараметрыУстановкиСвойствСубконтоСчетДоходовРасходов(ЭтотОбъект));
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьВалютныеПересчетыИзВалютыМУВВалютуДокумента(ПараметрыОС)
		
	МассивСуммДляПересчета = Новый Массив;
	МассивСуммДляПересчета.Добавить("БалансоваяСтоимость");
	МассивСуммДляПересчета.Добавить("НачисленнаяАмортизация");
	МассивСуммДляПересчета.Добавить("ПервоначальнаяСтоимость");
	Если Не ДанныеБУ Тогда 
		МассивСуммДляПересчета.Добавить("СуммаОбесценения");
	КонецЕсли;
	
	МассивОС = Новый Массив;
	Для каждого КлючИЗначение Из ПараметрыОС Цикл
		МассивОС.Добавить(КлючИЗначение.Ключ);
	КонецЦикла;
	
	ПараметрыКурсаДокумента = Новый Структура("Валюта, Курс, Кратность",
		Объект.ВалютаДокумента, Объект.КурсДокумента, Объект.КратностьДокумента);
	ПараметрыКурсаВалютыМУ = Новый Структура("Валюта, Курс, Кратность",
		ВалютаМСФО, 1, 1);
		
	СтруктураКурсыВалют = Новый Структура("МУ", ПараметрыКурсаВалютыМУ);
	Реквизиты = Новый Структура("Организация", Объект.Организация);
	ИсторическиеКурсы = бит_му_ВНА.ИсторическиеКурсыВалют(Реквизиты, МассивОС, Объект.Дата, СтруктураКурсыВалют); 
		  		
	Для каждого КлючИЗначение Из ПараметрыОС Цикл
		
		КурсыМУ = ИсторическиеКурсы[КлючИЗначение.Ключ].МУ;
		
		ВНА = КлючИЗначение.Значение;
		
		Для каждого ИмяСуммы Из МассивСуммДляПересчета Цикл
			ВНА[ИмяСуммы] = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(ВНА[ИмяСуммы],
				КурсыМУ, ПараметрыКурсаДокумента);
		КонецЦикла; 
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти
